package com.zhile.excelutil.controller

import com.zhile.excelutil.dao.ImDepartmentRepository
import com.zhile.excelutil.dao.ImItemRepository
import org.springframework.web.bind.annotation.GetMapping
import org.springframework.web.bind.annotation.RequestMapping
import org.springframework.web.bind.annotation.RestController


/**
 * @author Rinhon
 * @date 2025/6/17 09:09
 * @description:  测试
 */
@RestController
@RequestMapping(name = "test", value = ["/test"])
class TestController(
    private val imDepartmentRepository: ImDepartmentRepository,
    private val imItemRepository: ImItemRepository,

    ) {


    @GetMapping(value = ["/test"])
    fun test(): String {


//        imItemRepository.insertItem(
//            code = null,
//            name = null,
//            abbr = null,
//            barCode = null,
//            setPrice = null,
//            spec = null,
//            publishType = null,
//            publishMethod = null,
//            category = null,
//            itemType = null,
//            nature = null,
//            length = null,
//            width = null,
//            height = null,
//            packUnit = null,
//            unit = null,
//            kit = null,
//            isbn = null,
//            auxCode = null,
//            seriesName = null,
//            viceBookName = null,
//            editionYearMonth = null,
//            editionNo = null,
//            mainAuthor = null,
//            departmentCode = null,
//            departmentName = null,
//            dutyEditorCode = null,
//            dutyEditorName = null,
//            publishPeriod = null,
//            printSheet = null,
//            format = null,
//            formatSize = null,
//            topicType = null,
//            bindingType = null,
//            language = null,
//            noteLanguage = null,
//            summary = null,
//            perface = null,
//            catalog = "1 食材重量巧估法2 烹饪工具选择应用3 切菜必备技法6 油温辨别方法7 第一章高汤怎么做才好吃8 自制高汤，让美味加倍12 土豆奶汤炖牛肉12 奶汤烧豆腐13 奶汤鸡脯14 花生焖猪蹄14 高汤猪肚15 小鸡炖蘑菇15 冬菇当归肉片汤16 莲藕炖牛肉17 春笋焖黄鱼17 清汤鲫鱼18 素烧冬瓜18 浇汁平菇19 三鲜浇蛋羹19 菜花香菇20 玉米什锦汤20 海鲜豆腐汤21 第二章食材预处理 美味加倍22 食材预处理，方法大揭秘24 黄鳝炒苦瓜24 蔬菜鱼香沙拉25 菠菜粉丝25 咖喱豆腐26 面筋丝瓜26 菠菜拌豆腐泥26 清新小炒27 芹菜拌花生仁27 蒜香豇豆28 三鲜拌春笋28 香菇栗子29 香炸梅花肉30 双椒炒鸭舌30 香酥豆腐31 韭菜银鱼31 劲辣草鱼32 香菇茯苓烧豆腐32 胡萝卜烧鳝丝33 土豆炒牛肉33 家常烧牛肉34 锦绣鱼丝34 芦笋烩虾仁35 第三章掌握勾芡秘诀 道道菜经典36 用对淀粉，食物更诱人38 丝瓜干贝38 清炒虾段39 酱爆鸡丁39 酱辣带鱼40 姜丝炒鱿鱼40 蚝油青椒炒肉片41 当归党参炒鳝丝41 黄瓜肉丁42 香辣土豆片42 黑木耳炒山药43 辣白菜炒五花肉43 煎明虾段44 糖醋茄子45 平菇炒肉45 酱香茄子46 豆角炒茄条46 脆香虾球47 豆豉酱炒鲜鱿47 栗子烧白菜48 芹菜炒鸡片48 萝卜烧五花肉49 第四章用对调味料 色香味俱全50 常用的粉类调味品51 常用的液体调味品52 香料类调味品53 辛香蔬菜类调味品54 盐水虾54 盐焗鸡55 五香猪蹄56 孜然羊肉饼56 孜然烧羊肉57 白糖拌莲藕57 焦糖虾57 冰糖桂圆肉58 醋淋金针菇58 酸爽三色丁59 醋溜皮蛋60 香油豌豆60 香油拌香椿60 香油蚕豆61 豆豉蒜薹炒肉61 豆豉笋丁62 蒜蓉蒸丝瓜62 蒜泥鱼片63 蒜蓉蒸虾63 蒜香猪肋排64 葱香丝瓜64 葱香鲫鱼65 姜丝木耳65 滋补姜块羊肉汤66 姜丝豆芽苋菜66 嫩姜鸭舌67 香菜牛腩68 香菜拌花生68 木耳香菜汤69 第五章自制家常酱料 做菜更有味70 自制调料，烹饪更有味道73 豆豉蒸鱼73 豆豉双腊74 豉椒肉丝74 豆豉芹菜炒肉末75 双椒豉香鸭掌75 葱姜豆豉鸭76 豉香柚子皮76 豉香粉皮猪舌77 麻婆豆腐77 酱汁肝片78 豆瓣韭菜烧猪血78 辣炒乳鸽78 豆皮炒腊肉79 酱炒猪皮79 辣焖鱼块80 爆炒田螺80 豆酱鱼片81 番茄酱牡蛎81 番茄酱鲤鱼82 番茄酱鱼条82 番茄鱼排83 剁椒臭豆腐83 剁椒魔芋豆腐84 蛋丝烧豆皮84 香辣鸭掌85 白菜辣豆腐85 辣烧鸡爪86 香辣炝牛筋86 香辣扇贝87 麻酱淋菠菜87 麻酱四季豆88 三丝拌拉皮88 山药火龙果89 第六章巧做凉菜汁 风味香到你90 私房调味汁，凉菜也疯狂93 捞汁笋片93 酸辣凉拌扁豆93 酸辣虾94 爽口青木瓜94 酸辣苦瓜片95 酸辣冷牛肉95 酸辣什锦泡菜96 红油甘蓝白菜96 红油耳丝97 红油鱼皮97 红油鸡98 红油三丝98 红油腐竹99 怪味小鲫鱼99 怪味扇贝100 怪味油菜心100 怪味白肉101 蒜泥肉卷101 蒜泥木耳菜101 蒜泥海带丝102 姜汁甘薯条102 姜汁西蓝花102 黄鳝姜焖饭103 韭菜姜汁103 姜汁腰片103 核桃杏仁姜汤104 米椒姜汁牛肉104 菠菜姜汁塔105 芥末金针菇105 芥末双椒木耳106 芥末拌娃娃菜106 芥末扇贝106 芥末羊肉107 酱香肉末107 酱汁香菇108 酱香里脊肉108 酱汁焖海参109 第七章自制川湘料 让麻辣更过瘾110 自制川湘料，方法大揭秘114 泡菜牛蹄筋114 泡菜辣炒兔肉115 泡菜牛肉115 泡菜培根卷116 泡椒鸭片116 泡椒凤爪117 泡椒炒鸡胗117 泡椒南瓜118 鲜虾泡椒118 泡椒鸡杂119 榨菜炒肉片119 金针菇榨菜肉汤120 麻辣牛肉120 麻辣猪耳121 麻辣鸡腿121 麻辣子鸡122 麻辣烫122 麻辣虾皮123 鱼香淋豆腐123 鱼香萝卜木耳124 鱼香菠菜124 鱼香肉丝125 糖醋猪肝125 糖醋带鱼126 糖醋三丝126 糖醋圆白菜127 糖醋萝卜丝127 糖醋鱼丁128 椒麻鸡丝128 椒麻萝卜129 第八章选对畜肉 做出营养美味130 猪肉131 牛肉132 羊肉133 猪肉糯米酿苦瓜133 咸蛋黄蒸肉134 养生木耳瘦肉煲134 菠萝肉片134 黄瓜臊子肉135 酱香东坡肉135 海带烧五花肉136 腐乳五花肉136 卤五花肉137 山药丝炒腰花137 麻油猪腰138 清香猪小排138 糯米粉蒸排骨139 香辣猪前肘139 东坡肘子140 莴笋块炖猪蹄140 土豆酱猪蹄141 牛肉末炒豆腐141 素炒牛肉142 空心菜牛肉142 洋葱牛肉143 咖喱洋葱牛肉143 韩式泡菜牛肉144 奶香牛腩煲144 萝卜牛腩煲145 川味卤金钱肚145 沙茶金钱肚146 浇汁牛排146 法式牛排147 杂炒牛柳147 冬笋牛柳148 鲜美牛筋148 辣拌牛筋148 牛筋煲149 肉芥蓉炒羊肉149 黑木耳炒羊肉150 清蒸羊肉150 葱爆羊肉151 双椒百合羊肉151 孜然羊肉152 清炒羊肝152 韭菜炒羊肝153 秘制羊排154 枸杞山药炖羊排154 酱卤羊排155 第九章四大秘招 去掉肉类腥膻156 肉类去腥，方法解析158 牡蛎平菇汤158 韭菜炒猪腰159 连锅羊肉159 菇香叉烧肉160 常焖鲢鱼160 笋段黄花鱼161 香酥鲢鱼161 罗定鸡球162 苹果虾仁162 银罗牛柳163 红烧鸡丁豆腐164 蒜苗鲫鱼164 清香鲫鱼165 荷香鲫鱼165 草菇炒鳝鱼段166 椒麻鸡块166 焦炒里脊167 芹菜猪肝煲167 柠檬三文鱼168 素炒羊肉168 椒香皮皮虾169 香蘸鸡卷169 家常炸鸡翅170 滑炒川香肉片171 橙香酸溜肉片171 柠檬汁炒牡蛎172 酱焖黄鱼172 川湘腰花173 第十章七大绝招 肉质更鲜嫩174 解析七大绝招，肉质香嫩很容易176 清香黄瓜猪肝176 鱼香排骨177 双椒三文鱼177 苦瓜烧五花178 菠萝牛肉178 肉丝炒香菇179 三椒烧牛柳179 鲜蔬炒虾仁180 香菜炒牛肉180 香辣牛肉丝181 飘香牛肉片181 麻香菠菜猪肝182 酸辣鳕鱼182 火爆鳝段183 西红柿烧排骨184 麻香腰花184 鲜蔬炒鸡丝185 第十一章六法联用 煎出香脆美味186 巧用方法，煎出美味188 简易煎猪肝188 素煎茄片188 苋菜煎黄瓜189 韭菜煎饼189 素馅煎饺190 荷塘风味煎190 柠檬鲳鱼191 蛤蜊煎蛋191 香煎鲤鱼192 香煎鸡腿排193 煎红薯饼193 黄油煎鳕鱼194 白兰地三文鱼194 南煎肝195 葱煎鲫鱼195 锅贴豆腐196 南煎丸子196 黑椒煎牛排197 第十二章七大炒法 炒出活色生香198 各式炒法，特点技巧大揭秘200 红椒炒藕丝200 香菇炒生菜200 青椒炒腐竹201 西芹炒黑木耳201 香炒鸡杂202 小炒杏鲍菇202 酸白菜炒肉丝203 青椒炒鸭蛋203 苦瓜炒鸡蛋204 蒜薹炒鸡蛋204 西红柿炒鸡蛋205 西蓝花炒百合205 葱炒木耳206 鸡蛋炒芹菜206 蛋丝炒茶树菇207 双耳炒金针菇207 油菜炒毛豆208 清炒口蘑208 小炒猪舌208 鸡肉片炒红椒209 青椒炒鸡丝209 清炒猪肚210 清炒泥鳅210 冬笋荸荠炒鸡肉211 清炒西葫芦丝211 清炒牛肚212 干煸鸡爪212 干煸鸭舌213 干煸肉末四季豆213 干煸鸡块214 苦瓜青椒煸鸭肉214 干煸牛肉条215 爆炒鱿鱼215 鸡肉爆平菇216 爆炒草菇216 油爆鱼片217 熘肥肠217 熘肝尖218 焦熘豆腐218 肉片熘草菇219 第十三章选对炸法 让食物更诱人220 选对炸法，炸出各式美味222 油炸杏鲍菇222 香炸河虾223 脆香鸡排224 香酥带鱼224 炸八块225 炸青鱼排225 酥脆炸鸡226 酥香鸡米花226 回锅鱼227 酥脆里脊227 油炸金针菇227 油炸香椿228 酥香板鸭228 酥香草鱼块229 糖醋鲤鱼块229 香酥鹌鹑230 炸芝麻里脊230 炸香菇231 蛋炸秋葵231 油炸椒盐蘑菇232 附录一食材的选购窍门238 附录二食材的清洗窍门242 附录三食材的保存窍门",
//            bookReview = null,
//            bookAbstract = null,
//            cipInfo = null,
//            remarks = null,
//            id = null,
//            itemTypeId = null,
//            editDepartmentId = null,
//            dutyEditorId = null,
//            publishPeriodId = null,
//            formatId = null,
//            formatSizeId = null,
//            natureId = null,
//            languageId = null,
//            noteLanguageId = null,
//            publishMethodId = null,
//            unitId = null,
//            bindingTypeId = null,
//            cipType = TODO()
//        )
        return "test"
    }

}